import 'package:flutter/cupertino.dart';
import 'package:cloud_firestore/cloud_firestore.dart';
import 'news_item.dart';

class NewsData extends ChangeNotifier {
  final CollectionReference newsCollection = FirebaseFirestore.instance.collection('news');

  Future<void> addNews({
    required String imageUrl,
    required String title,
    required String date,
    required String category,
    required String text,
  }) async {
    await newsCollection.add({
      'imageUrl': imageUrl,
      'title': title,
      'date': date,
      'category': category,
      'text': text,
    });

    notifyListeners();
  }

  Stream<List<News>> getNews() {
    return newsCollection.snapshots().map((querySnapshot) {
      List<News> newsList = [
        News(
            imageUrl: "images/apple.jpeg",
            title: "تکنولوژی جدید اپل: نوآوری‌ها و رقابت در دنیای فناوری",
            date: "جمعه ۵ سنبله ۱۴۰۲",
            category: "تکنالوژی",
            text:
            'به روزآوری: جلسه برگزاری کمپانی اپل به تازگی نسبت به تکنولوژی‌های جدید خود با عنوان "تکنولوژی جدید اپل: نوآوری‌ها و رقابت در دنیای فناوری" به پایان رسیده است. در این جلسه، اپل از طیف گسترده‌ای از نوآوری‌ها و بهبودهای فنی که در محصولات و خدمات خود پیاده‌سازی کرده است، به تفصیل سخن گفت. یکی از مهمترین مواردی که توجه بسیاری از علاقه‌مندان به فناوری را به خود جلب کرده، معرفی نسل جدید دستگاه‌های هوشمند اپل بوده ا. این دستگاه‌ها با استفاده از تکنولوژی‌های پیشرفته‌تری در زمینه پردازش، دوربین‌های با کیفیت بالا و قابلیت‌های ارتباطی نوین، تجربه‌ای جدید از استفاده از دستگاه‌های هوشمند را به کاربران ارائه می‌دهند.همچنین، در این جلسه به موضوع رقابت در دنیای فناوری نیز پرداخته شد. با توجه به رقابت شدید میان شرکت‌های فناوری برتر، اپل تلاش دارد تا با ارائه نوآوری‌های منحصر به فرد، جایگاه خود را در این بازار حفظ کند. تنوع محصولات، خدمات به کاربران و تمرکز بر ارتقاء تجربه کاربری از جمله راهکارهای اصلی اپل برای مقابله با رقباست. با توجه به تأثیر گذاری اپل در دنیای فناوری و تکنولوژی، انتظار می‌رود که موفقیت‌ها و نوآوری‌های اعلامی این شرکت، تأثیرات چشمگیری در بازار و جامعه فناوری داشته باشد.'),
        News(
            imageUrl: "images/afg.jpeg",
            title: "وضعیت سیاسی افغانستان: چالش‌ها و تحولات در منطقه",
            date: "یکشنبه ۴ سنبله ۱۴۰۲",
            category: "سیاسی",
            text:
            " گزارش ویژه: با تغییرات سیاسی اخیر در افغانستان، منطقه‌ای که همواره به عنوان یکی از مراکز حساس جهان شناخته می‌شود، با چالش‌ها و تحولات جدیدی مواجه است. وضعیت سیاسی افغانستان پس از تغییر حکومت و تسلیم قدرت به گروه‌های مختلف، به عنوان یکی از موضوعات پربحث و جذاب در روزهای اخیر مطرح شده است.با ورود نیروهای جدید به صحنه سیاست افغانستان، اهمیت برقراری ثبات و امنیت در این کشور بیش از پیش به چشم می‌آید. تداوم نزاعات داخلی، تلاش‌های مختلف گروه‌ها برای جلب قدرت و تعیین سرنوشت کشور، همچنین تأثیر تصمیمات بین‌المللی بر وضعیت افغانستان، به تأثیرات عمیقی در منطقه منجر شده است. این تحولات در وضعیت سیاسی افغانستان نیز نقش خود را در شکل‌گیری تعادل قوا، تأثیرگذاری بر امنیت منطقه و تغییرات در دینامیک‌های منطقه‌ای دا. کشورهای همسایه و جامعه بین‌الملل باید با بهبود وضعیت افغانستان و کمک به فرآیند‌های پیشرفت و پایداری در این کشور، به ایجاد تعادل در منطقه کمک نمایند با توجه به این وضعیت پیچیده، تحلیلگران سیاسی تأکید دارند که راهکارهایی که به منظور حفظ ثبات در افغانستان و منطقه لازم است، نیازمند همکاری گسترده و هماهنگی بین کشورهای مختلف و سازمان‌های بین‌المللی است. تحولات در وضعیت سیاسی افغانستان باید به گونه‌ای مدیریت شود که از نظر امنیتی، سیاسی به منفعت تمامی کشورهای منطقه با"),
        News(
            imageUrl: "images/sport.jpeg",
            title: "اخرین پیشرفت رویدادهای مهم عرصه ورزش افغانستان",
            date: "شنبه ۲ سنبله ۱۴۰۲",
            category: "ورزشی",
            text:
            " گزارش ویژه: با تغییرات سیاسی اخیر در افغانستان، منطقه‌ای که همواره به عنوان یکی از مراکز حساس جهان شناخته می‌شود، با چالش‌ها و تحولات جدیدی مواجه است. وضعیت سیاسی افغانستان پس از تغییر حکومت و تسلیم قدرت به گروه‌های مختلف، به عنوان یکی از موضوعات پربحث و جذاب در روزهای اخیر مطرح شده است.با ورود نیروهای جدید به صحنه سیاست افغانستان، اهمیت برقراری ثبات و امنیت در این کشور بیش از پیش به چشم می‌آید. تداوم نزاعات داخلی، تلاش‌های مختلف گروه‌ها برای جلب قدرت و تعیین سرنوشت کشور، همچنین تأثیر تصمیمات بین‌المللی بر وضعیت افغانستان، به تأثیرات عمیقی در منطقه منجر شده است. این تحولات در وضعیت سیاسی افغانستان نیز نقش خود را در شکل‌گیری تعادل قوا، تأثیرگذاری بر امنیت منطقه و تغییرات در دینامیک‌های منطقه‌ای دا. کشورهای همسایه و جامعه بین‌الملل باید با بهبود وضعیت افغانستان و کمک به فرآیند‌های پیشرفت و پایداری در این کشور، به ایجاد تعادل در منطقه کمک نمایند با توجه به این وضعیت پیچیده، تحلیلگران سیاسی تأکید دارند که راهکارهایی که به منظور حفظ ثبات در افغانستان و منطقه لازم است، نیازمند همکاری گسترده و هماهنگی بین کشورهای مختلف و سازمان‌های بین‌المللی است. تحولات در وضعیت سیاسی افغانستان باید به گونه‌ای مدیریت شود که از نظر امنیتی و سیاسی به منفعت تمامی کشورهای منطقه با"),
        News(
            imageUrl: "images/criket.jpg",
            title: "فهرست بازی های تیم ملی کرکت برای سال های ۲۰۲۲-۲۰۲۳ اعلام شد",
            date: "دوشنبه ۱۲ سنبله ۱۴۰۲",
            category: "ورزشی",
            text:
            " گزارش ویژه: با تغییرات سیاسی اخیر در افغانستان، منطقه‌ای که همواره به عنوان یکی از مراکز حساس جهان شناخته می‌شود، با چالش‌ها و تحولات جدیدی مواجه است. وضعیت سیاسی افغانستان پس از تغییر حکومت و تسلیم قدرت به گروه‌های مختلف، به عنوان یکی از موضوعات پربحث و جذاب در روزهای اخیر مطرح شده است.با ورود نیروهای جدید به صحنه سیاست افغانستان، اهمیت برقراری ثبات و امنیت در این کشور بیش از پیش به چشم می‌آید. تداوم نزاعات داخلی، تلاش‌های مختلف گروه‌ها برای جلب قدرت و تعیین سرنوشت کشور، همچنین تأثیر تصمیمات بین‌المللی بر وضعیت افغانستان، به تأثیرات عمیقی در منطقه منجر شده است. این تحولات در وضعیت سیاسی افغانستان نیز نقش خود را در شکل‌گیری تعادل قوا، تأثیرگذاری بر امنیت منطقه و تغییرات در دینامیک‌های منطقه‌ای دا. کشورهای همسایه و جامعه بین‌الملل باید با بهبود وضعیت افغانستان و کمک به فرآیند‌های پیشرفت و پایداری در این کشور، به ایجاد تعادل در منطقه کمک نمایند با توجه به این وضعیت پیچیده، تحلیلگران سیاسی تأکید دارند که راهکارهایی که به منظور حفظ ثبات در افغانستان و منطقه لازم است، نیازمند همکاری گسترده و هماهنگی بین کشورهای مختلف و سازمان‌های بین‌المللی است. تحولات در وضعیت سیاسی افغانستان باید به گونه‌ای مدیریت شود که از نظر امنیتی، اقتصادی و سیاسی به منفعت تمامی کشورهای منطقه با"),
        News(
            imageUrl: "images/corona.jpeg",
            title: "اخرین وضیعت و اقدامات مرتبط با ویروس کرونا در افغانستان",
            date: "پنجشنبه ۴ میزان ۱۴۰۲",
            category: "صحی",
            text:
            " گزارش ویژه: با تغییرات سیاسی اخیر در افغانستان، منطقه‌ای که همواره به عنوان یکی از مراکز حساس جهان شناخته می‌شود، با چالش‌ها و تحولات جدیدی مواجه است. وضعیت سیاسی افغانستان پس از تغییر حکومت و تسلیم قدرت به گروه‌های مختلف، به عنوان یکی از موضوعات پربحث و جذاب در روزهای اخیر مطرح شده است.با ورود نیروهای جدید به صحنه سیاست افغانستان، اهمیت برقراری ثبات و امنیت در این کشور بیش از پیش به چشم می‌آید. تداوم نزاعات داخلی، تلاش‌های مختلف گروه‌ها برای جلب قدرت و تعیین سرنوشت کشور، همچنین تأثیر تصمیمات بین‌المللی بر وضعیت افغانستان، به تأثیرات عمیقی در منطقه منجر شده است. این تحولات در وضعیت سیاسی افغانستان نیز نقش خود را در شکل‌گیری تعادل قوا، تأثیرگذاری بر امنیت منطقه و تغییرات در دینامیک‌های منطقه‌ای دا. کشورهای همسایه و جامعه بین‌الملل باید با بهبود وضعیت افغانستان و کمک به فرآیند‌های پیشرفت و پایداری در این کشور، به ایجاد تعادل در منطقه کمک نمایند با توجه به این وضعیت پیچیده، تحلیلگران سیاسی تأکید دارند که راهکارهایی که به منظور حفظ ثبات در افغانستان و منطقه لازم است، نیازمند همکاری گسترده و هماهنگی بین کشورهای مختلف و سازمان‌های بین‌المللی است. تحولات در وضعیت سیاسی افغانستان باید به گونه‌ای مدیریت شود که از نظر امنیتی، اقتصادی و سیاسی به منفعت تمامی کشورهای منطقه با"),
      ];
      querySnapshot.docs.forEach((document) {
        Map<String, dynamic> data = document.data() as Map<String, dynamic>;
        News news = News(
          imageUrl: data['imageUrl'],
          title: data['title'],
          date: data['date'],
          category: data['category'],
          text: data['text'],
        );
        newsList.add(news);
      });
      return newsList;
    });
  }
}
